Repository: 84000/translation-memory-resources
Catalog: post_input/toh101.bo.en.tmx
Source language: bo
Languages: en

source: གང་དག་ ང་ ཡི་ མདུན་ ན་ ཐལ་སྦྱར་ ཅིང་ །_། འཁོད་པ འི་ དགེ་སློང་ བརྒྱད་ འདི་ མ་གཏོགས་པ །_། བློ་གྲོས་ བརྟན་པ་ ཕྱི་མ འི་ དུས་ ན་ འདིར །_། མདོ་སྡེ་ འདི་ འཛིན་ སུ་ ཡང་ འབྱུང་ མི་ འགྱུར །_།
en: $2043 “Except for these eight monks Who are seated in front of me with palms joined, There will never be anyone here in the future, Dṛḍhamati, To uphold this sūtra.

source: བློ་གྲོས་ བརྟན་པ་ འདི་དག་ རྟག་ ཏུ་ ཡང་ །_། འདས་པ འི་ སངས་རྒྱས་ མཚུངས་མེད་ སྤྱོད་ཡུལ་ ཡིན །_།
en: $2044 “Dṛḍhamati, they have continually partaken Of the incomparable experience of past buddhas.

source: དེ་དག་ རྟག་པ ར་ སྔོན་ དུ་ འགྲོ་བ ར་ འགྱུར །_། |#| དེ་དག་ ཆོས་ ཀྱི་ སྣོད་ དུ་ གྱུར་པ་ ཡིན །_།
en: They have always approached, Being vessels for the Dharma.

source: དེ་ ཚེ་ བྱང་ཆུབ་ སེམས་ ནི་ ཡང་དག་ ལེན །_། |#| སངས་རྒྱས་ རྣམས་ ཀྱིས་ རྟག་པ ར་ བསྔགས་པ འང་ ཡིན །_།
en: $2045 “They fully took on the mind of awakening, And were continually praised by buddhas.

source: ཇི་ལྟ ར་ དེ་དག་ ང་ ཡི་ མདུན་ འཁོད་པ །_། དེ་བཞིན་ འདས་པ འི་ དུས་ ན འང་ ངས་ ཤེས་ ཏེ །_།
en: I know that just as they sit before me, So too did they in the past.

source: དེ་དག་ གང་ གཱའི་ ཀླུང་ གི་ བྱེ་ སྙེད་ ཀྱི །_། རྒྱལ་བ་ དེ་དག་ རྣམས་ ཀྱི་ སྤྱན་སྔ ར་ འཁོད །_།
en: $2046 “They have sat in the presence of as many victorious ones As there are grains of sand in the river Ganges.

source: དེ་ ཡི་ འོག་ ཏུ་ ལྔ་ བརྒྱ་ འཁོད་པ་ ཡིན །_། |#| བྱང་ཆུབ་ མཆོག་ དེ་ ངས་ ཀྱང་ གཟུང་བ ར་ བྱ །_།
en: They will be present later, in the final five hundred years of the Dharma, When I too will uphold that supreme awakening.

source: ཕྱི་དུས་ རྒྱལ་བ འི་ ཡེ་ཤེས་ དེ་དག་ ཡིན །_།
en: $2047 “In later times, the wisdom of the victorious ones will be theirs, And

source: བརྟན་པ འི་ བློ་གྲོས་ ཁྱོད་ ཀྱང་ དེ་ ལ་ དཔའ །_།
en: you too, Dṛḍhamati, will be courageous in it.

source: གང་དག་ ཆོས་ ཀུན་ གཟུང་ ཕྱིར་ ཞུགས་པ་ ནི །_། གཞན་ ཡང་ དཔའ་བོ་ དུང་ཕྱུར་ ཕྲག་ བརྒྱད་ དོ །_།
en: There will also be eight million other heroes Who will set out to uphold all teachings.

source: ངས་ ཀྱང་ དེར་ ནི་ ཆོས་ མཉན་ བྱ་བ་ ཡིན །_།
en: $2048 “I too will listen to the Dharma there.

source: ཐོས་པ ར་ གྱུར་ ནས་ ཀྱང་ ནི་ ཆོས་ དེ་ ལ །_། གནས་པ ར་ བྱ་ སྟེ་ སྤྱོད་པ་ མི་ ཞན་པ །_། དེ་ ཡི་ ཚེ་ ན་ བསྟན་པ ར་ བྱ་བ་ ཡིན །_།
en: Having heard it, I will abide by the Dharma, Practicing it without respite. |#| Then I will teach it.

source: དེ་ ཚེ་ སྟོན་པ ས་ བྱང་ཆུབ་ མཆོག་ ལུང་ བསྟན །_།
en: $2049 “And by teaching it, I will prophesy supreme awakening.

source: རང་རང་ ལུང་བསྟན་པ་ ནི་ ཐོས་ ནས་ སུ །_། དུང་ཕྱུར་ ཕྲག་ བརྒྱད་ དགའ་བ ས་ ཁྱབ་ གྱུར་ ནས །_། |#| ཏ་ལ་ བདུན་ སྲིད་ མངོན་པར་ འཕགས་པ ར་ གྱུར །_།
en: Upon hearing their own predictions given, May the eight million be filled with joy, And levitate to a height of seven palm trees.”

source: འཇིག་རྟེན་ མགོན་པོས་ ཀུན་དགའ་ བཀའ་ སྩལ་པ །_།
en: $2050 The Savior of the World then said to Ānanda,

source: ཕྱི་མ འི་ དུས་ ཚེ་ སྡིག་པ་ ཅན་ དེར་ ནི །_། ཆོས་ འདི་ འཛིན་པ ར་ སྤྲོ་ ཞིང་ ནུས་ གྱུར་ ཏམ །_།
en: “Would you be delighted and able To uphold this Dharma For the wicked in the future?”

source: མི་ སྤྲོ་ ཞེས་ ནི་ བཅོམ་ལྡན་འདས་ ལ་ གསོལ །_།
en: $2051 “I would not be so delighted,” he said to the Blessed One.

source: མཁྱེན་ བཞིན་ རྒྱལ་བ་ འོད་སྲུང་ བཀའ་ སྩལ་པ །_།
en: The victorious one then knowingly said to Kāśyapa,

source: འོད་སྲུང་ ཆོས་ འདི་ འཛིན་པ ར་ བྱེད་ འགྱུར་ རམ །_།
en: “Kāśyapa, will you uphold this Dharma?

source: ཡོངས་སུ་ མྱ་ངན་ འདས་ ནས་ |#| ཆོས་ ཟུང་ ཤིག _།
en: You should uphold the Dharma once I have passed!”

source: མི་ སྤྲོ་ ལགས་སོ་ ཞེས་ ཏེ་ འོད་སྲུང་ སོང་ །_།
en: $2052 “I would not delight in doing so,” said Kāśyapa.

source: སྟོང་གསུམ་ འཇིག་རྟེན་ ཁམས་ འདི་ སྐྱེ་བོ་ དང་ །_། རྒྱ་མཚོ་ རི་ དང་ ནགས་ཚལ་ བཅས་ གཟུང་ ཞིང་ །_། ཁུར་ གཞན་ མང་པོ་ བསྐུར་བ ར་ སྤྲོ་ ལགས་ ཀྱི །_།
en: “This trichiliocosm upholds all people, Oceans, mountains, and forests, And delights in bearing many other loads besides. |#| $2053 “But

source: ཁུར་ འདི་ བསྐུར་བ ར་ བདག་ ནི་ མི་ སྤྲོ་ ལགས །_།
en: I would not delight in carrying this load.

source: སླད་མ འི་ དུས་ ན་ སུ་ཞིག་ ཆོས་ འཛིན་ ལགས །_།
en: Who will uphold the Dharma in the future?

source: !དེ་ཉིད་ དགེ་སློང་ ཤིན་ཏུ་ དབང་ བགྱི་ དཀའ །_། |#| རྗེས་སུ་ བསྟན་པ་ འདི་ ལ་ གནས་ མི་ [227a] བགྱིད །_།
en: It would be very difficult for me#94 to control the monks. |#| As they will not abide by this teaching, [227.a]

source: འཇིག་རྟེན་ འདྲེན་པ་ མྱ་ངན་ འདས་ ཅི་ སྨོས །_།
en: $2054 “There is no need to mention that the guide of the world will have passed beyond.

source: འོད་སྲུང་ ཁྱོད་ ནི་ རྒས་འཁོགས་ གྱུར་ ཏོ་ ཞེས །_། སླད་ དུས་བདག་ གི་ ཚིག་ བཞིན་ ཡོང་ མི་ བགྱིད །_།
en: They will say, ‘Kāśyapa, you have become too old,’ And so, in the future, my words will not be followed.

source: བདག་ གི་ རྗེས་སུ་ བསྟན་ ལ་ གནས་ མི་ འགྱུར །_།
en: They will not abide by my teachings.

source: བདག་ཅག་ འདི་ ནི་ མཁས་ ཤིང་ དོན་ སེམས་ སྙམ །_། |#| སྙན་དངགས་ འཇིག་རྟེན་ རྒྱང་ ཕན་སེམས་པ་ ལགས །_། དེ་བཞིན་ འཇིག་རྟེན་ སྒྲ་ ཡིས་ གནས་པ་ ལགས །_།
en: $2055 “Thinking, ‘We are adept in this and reflect on its meaning,’ They will reflect upon poetics and materialism, And likewise adhere to mundane grammar.

source: བསམ་གཏན་ དེ་བཞིན་ ཏིང་ངེ་འཛིན་ སྤངས་ ནས །_། |#| དེ་དག་ འཇིག་རྟེན་པ་ ལ་ སྤྱོད་པ ར་ འགྱུར །_།
en: Discarding concentration and absorption, |#| $2056 “They cavort with the worldly.

source: རྒྱས་པ་ ཆེ་ དང་ གྲགས་པ་ ཆེན་པོ་ ལགས །_། རྟག་ ཏུ་ འཇིག་རྟེན་ གྱིས་ ཀྱང་ མཐོང་བ ར་ འགྱུར །_།
en: They will be prosperous and widely renowned, And continually regarded by the world.

source: དེ་དག་ བདག་ གིས་ ནམ་ཡང་ བརྟག་ མི་ ནུས །_།
en: I could never examine them,

source: སྐྱོན་ རྣམས་ དམ་པོ་ དག་ ནི་ མཐོང་ ལགས་སོ །_།
en: $2057 “And I see severe problems.

source: བདག་ ནི་ གཅིག་པུ ར་ དགོན་པ ར་ གནས་པ་ ན །_།
en: While I was dwelling alone in the forest,

source: ལྷ་ ཞིག་ མཆིས་ ནས་ བདག་ ལ་ འདི་སྐད་ བརྗོད །_།
en: A god appeared and said to me,

source: ཆོས་ དེ་ འདྲ་བ ར་ རྒྱལ་བ་ རྣམས་ ཀྱིས་ བསྟན །_།
en: ‘The victorious ones have taught such a Dharma.

source: འཕགས་པ འི་ ཆོས་ ལ་ སེམས་ཅན་ མང་པོ་ བཏུལ །_།
en: $2058 “ ‘Many beings have been tamed in the Dharma of the noble ones.

source: དགེ་སློང་ བསམ་གཏན་ ཏིང་ངེ་འཛིན་ ལ་ མཁས །_། |#| རྣམ་ཐར་ རྫུ་འཕྲུལ་ སྟོབས་ ཀྱི་ ཕ་རོལ་ ཕྱིན །_།
en: Monks have become adept in concentration and absorption, And perfected the liberations, miraculous abilities, and powers.

source: ཐོས་ ནས་ བརྒྱ་བྱིན་ དགའ་བ ར་ འགྱུར་བ་ ལགས །_།
en: Hearing this, Śakra will be pleased.

source: དེ་རིང་ དེ་ ལ་ ངོ་མཚར་ ཅི་ མཆིས་ སྨྲ །_།
en: $2059 “ ‘How amazing this is today!’

source: ཕྱི་དུས་ བདག་ གི་ ཐད་ དུ་ དེ་ མཆིས་ ནས །_། |#| དེ་ ཚེ་ ཡིད་ མི་ བདེ་བ ས་ ངུ་ ཞིང་ སྟོན །_།
en: Later he will come to me, And crying unhappily, declare,

source: འོད་སྲུང་ དེང་ ནི་ བསྟན་པ་ འཇིག་པ ར་ འགྱུར །_།
en: ‘Kāśyapa, the Dharma will soon disappear.’

source: དེ་ ཐོས་ བདག་ ནི་ ཡིད་ མི་ བདེ་བ ར་ འགྱུར །_། |#| མང་ དུ་ འཆད་པ ར་ ཡང་ ནི་ སྤྲོ་ མ་ ལགས །_།
en: $2060 “Hearing that I will be upset, And not be eager to teach much.

source: མདོ་སྡེ་ དེ་ ནི་ འཛིན་པ ར་ སྤྲོ་ མ་ ལགས །_།
en: I am not eager to uphold that sūtra, For

source: དེར་ ནི་ དེ་དག་ ཞུམ་པ ར་ འགྱུར་བ་ ལགས །_། |#| དགེ་སློང་ མཆོག་ ཏུ་ བཀའ་བློ་ མི་ བདེ་ འགྱུར །_།
en: the monks will cower before it. |#| $2061 “They will not be pleased with the supreme speech, And

source: དེ་ ཚེ་ དེར་ ནི་ ལྷ་ཚོགས་ འདུ་བ ར་ འགྱུར །_།
en: then the divine assembly will gather there.”

source: བཅོམ་ལྡན་འདས་ ཀྱིས་ འོད་སྲུང་ བཀའ་ སྩལ་པ །_།
en: The Blessed One said to Kāśyapa,

source: ཆོས་ ཀྱི་ ཚུལ་ ནི་ འཛིན་པ ར་ མི་ ནུས་པ ར །_། འོད་སྲུང་ དེ་ ནི་ ང་ ཡིས་ སྔ་ ནས་ ཤེས །_།
en: “I already knew, Kāśyapa, that the way of Dharma cannot be upheld.

source: མདོ་སྡེ་ དེ་ འདྲ་ དེ་ ནི་ གང་ འཛིན་པ །_། ང་ ཡི་ ཉན་ཐོས་ གང་ཡང་ འདི་ ན་ མེད །_།
en: $2062 “There is no one here among my hearers Who will uphold such sūtras as that.

source: གང་དག་ མདོ་སྡེ་ དེ་ འདྲ་ དེ་ |#| འཛིན་པ །_། ང་ ཡིས་ གང་དག་ བྱིན་རླབས་ དེར་ མ་གཏོགས །_།
en: Except for those authorized by me To uphold such sūtras,

source: གང་དག་ ཕྱི་ ནས་ ཐེ་ཚོམ་ མེད་ འགྱུར་བ །_། དེ་དག་ ཐེ་ཚོམ་ དེ་ ནི་ ང་ ཡིས་ གཅད །_།
en: $2063 “Those who will later have no doubt, Will have had their doubts resolved by me.

source: གཞན་དག་ ལས་ ནི་ མཐུ་ ཆེ་ གང་ཡིན་པ །_། མདོ་སྡེ་ དེ་ ལ་ ཅི་ཕྱིར་ སྔོན་མ་ སྤྱད །_།
en: Why have those sūtras, more powerful than others, Never before been practiced?

source: དེ་དག་ འཛིན་པ འི་ དགེ་སློང་ གསར་བུ་ གཞོན །_། |#| མདོ་སྡེ་ དེ་དག་ རྒྱས་པ་ ཆེན་པོ་ ཡིན །_།
en: $2064 “The monks who uphold them are new and young, While the sūtras are extensive.

source: གང་དག་ ཆོས་ དེ་ འདྲ་བ་ དེ་ མི་ འཛིན །_། |#| འདི་ ལ་ ཇི་ལྟ ར་ ཕ་རོལ་ ཕྱིན་པ ར་ འགྱུར །_།
en: How will those who do not uphold such a Dharma Reach its other shore?

source: བརྟན་པ འི་ བློ་གྲོས་ ང་ ཡིས་ [227b] བསྟན་པ་ ན །_། |#| གང་དག་ གིས་ ནི་ དེ་རིང་ ང་ མཐོང་ འགྱུར །_། |#| དེ་དག་ ཕྱི་དུས་ འཇིགས་པ་ ཆེན་པོ འི་ ཚེ །_། ཆོས་ དེ་ ཐོས་ ནས་ དགའ་བ་ ཐོབ་པ ར་ འགྱུར །_།
en: $2065 “Dṛḍhamati, those who see me today While I teach [227.b] Will, in future times of great peril, Acquire joy upon hearing that Dharma.

source: ང་ ནི་ དམིགས་པ་ འབའ་ཞིག་ འཆད་པ་ ཡིན །_།
en: $2066 “I have explained only apprehension.

source: འཇིགས་མེད་ ང་ ཡི་ ཚིག་ དེར་ དད་པ ར་ བྱོས །_།
en: The fearless should have faith in those words of mine.

source: གང་ གི་ འདི་ ན་ སྟོན་པ་ མཐོང་ གྱུར་པ །_། དེ་ དག་ ཆོས་ དེ་ འཛིན་པ ར་ སྤྲོ་བ ར་ འགྱུར །_།
en: Those who have seen the teacher in this life Will be delighted to uphold that Dharma.

source: ཡེ་ཤེས་ དེ་ འདྲ་ དེ་ ནི་ ཚོལ་ བྱེད་ ཅིང་ །_། དེ་ ཚེ་ འདྲེན་པ་ རྣམས་ ལ་ མཆོད་པ ར་ བྱེད །_།
en: $2067 “They will pursue such wisdom And then make offerings to the guides.

source: རིང་བསྲེལ་ མཆོད་ དང་ དེ་བཞིན་ མཆོད་རྟེན་ མཆོད །_།
en: They will worship relics and memorials too;

source: འཇིགས་མེད་ དེ་དག་ དེར་ ནི་ བྱེད་པ ར་ འགྱུར །_།
en: The fearless will act as such at that time.”

source: ཡོངས་སུ་ གཏད་པ འི་ ཕན་ཡོན་ གྱི་ ལེའུ་ སྟེ་ བཅོ་ ལྔ་པ འོ །།_།།
en: $2068 This concludes the fifteenth chapter.

source: དེ་ནས་ ཚེ་ དང་ ལྡན་པ་ ཀུན་དགའ་བོ་ སྟན་ ལས་ ལངས་ ནས །_ |#| བླ་གོས་ ཕྲག་པ་ གཅིག་ ཏུ་ གཟར་ ཏེ །_ |#| པུས་མོ་ གཡས་པ འི་ ལྷ་ང་ ས་ ལ་ བཙུགས་ ནས །_ |#| བཅོམ་ལྡན་འདས་ ལ་ འདི་སྐད་ ཅེས་ གསོལ་ ཏོ །_།
en: $2069 Ānanda then rose from his seat, draped his shawl over one shoulder, knelt on his right knee and asked the Blessed One,

source: བཅོམ་ལྡན་འདས་ ཆོས་ ཀྱི་ རྣམ་ གྲངས་ འདི འི་ མིང་ ཅི་ ལགས །_
en: “Blessed One, what is the name of this Dharma discourse?

source: དེ་ ཇི་ལྟ ར་ གཟུང་བ ར་ བགྱི །_
en: How will it be upheld?”

source: ཀུན་དགའ་བོ་ དེ འི་ ཕྱིར་ ཆོས་ ཀྱི་ རྣམ་ གྲངས་ འདི་ ནི་ དགེ་བ འི་ རྩ་བ་ ཡོངས་སུ་ འཛིན་པ་ ཞེས་ བྱ་བ ར་ ཟུང་ ཤིག་
en: “Ānanda, you should uphold this Dharma discourse as Upholding the Roots of Virtue .

source: བསོད་ནམས་ ཀྱི་ ཚོགས་ ཀྱི་ གནས་ ཞེས་ བྱ་བ ར་ ཡང་ ཟུང་ ཤིག བྱང་ ཆུབ་ སེམས་དཔའ་ འགྲོགས་པ་ ཞེས་ བྱ་བ ར་ ཡང་ ཟུང་ ཤིག _། |#| བྱང་ཆུབ་ སེམས་དཔ ས་ ཞུས་པ་ ཞེས་ བྱ་བ ར་ ཡང་ ཟུང་ ཤིག _། ཐེ་ཚོམ་ ཐམས་ཅད་ གཅོད་པ འི་ ལེའུ་ ཞེས་ བྱ་བ ར་ ཡང་ ཟུང་ ཤིག _།
en: You should also uphold it as Foundation of the Collection of Merit , or Aid to the Bodhisattvas , or The Inquiry Posed by the Bodhisattvas , or The Chapter that Resolves All Doubts .”

source: བཅོམ་ལྡན་འདས་ ཀྱིས་ དེ་སྐད་ ཅེས་ བཀའ་ སྩལ་ ནས
en: $2071 After the Blessed One thus spoke,

source: ཚེ་ དང་ ལྡན་པ་ ཀུན་དགའ་བོ་ དང་ །_ བྱང་ ཆུབ་ སེམས་དཔའ་ བརྟན་པ འི་ བློ་གྲོས་ དང་ །_ བྱང་ཆུབ་ སེམས་དཔའ་ དེ་དག་ དང་ །_ ཉན་ཐོས་ ཆེན་པོ་ དེ་དག་ དང་ །_ ལྷ་ དང་ །_ མི་ དང་ །_ ལྷ་མ་ ཡིན་ དང་ །_ དྲི་ཟ ར་ བཅས་པ འི་ འཇིག་རྟེན་ ཡི་ རངས་ ཏེ །_ |#| བཅོམ་ལྡན་འདས་ ཀྱིས་ གསུངས་པ་ ལ་ མངོན་པར་ བསྟོད་ དོ །_།
en: the venerable Ānanda, the bodhisattva Dṛḍhamati, the other bodhisattvas, the great hearers, and the world with its gods, humans, demigods, and gandharvas were all pleased and praised what the Blessed One had said.

source: འཕགས་པ་ དགེ་བ འི་ རྩ་བ་ ཡོངས་སུ་ འཛིན་པ་ ཞེས་ བྱ་ བ་ ཐེག་པ་ ཆེན་པོ འི་ མདོ་ རྫོགས་ སོ །།_།།
en: $2072 This concludes the noble Great Vehicle sūtra “Upholding the Roots of Virtue.”

source: རྒྱ་གར་ གྱི་ མཁན་པོ་ པྲཛྙཱ་ ཝརྨ་ དང་ །_ ལོ་ ཙྪ་བ་ བན་དེ་ ལེགས་ ཀྱི་ སྡེས་ བསྒྱུར །_ |#| རྒྱ་གར་ གྱི་ མཁན་པོ་ པྲཛྙཱ་ ཝརྨ་ དང་ །_ ཛྙཱ་ན་ གར་ བྷ་ དང་ །_ ཞུ་ཆེན་ གྱི་ ལོ་ ཙྪ་བ་ བན་དེ་ ཡེ་ཤེས་ སྡེས་ ཞུས་ ཏེ་ གཏན་ ལ་ ཕབ་པ །།_།།
en: $2073 Translated by the Indian preceptor Prajñāvarman and the translator the venerable Leki Dé, then revised and finalized by the Indian preceptors Prajñāvarman and Jñānagarbha, and the chief editor-translator the venerable Yeshé Dé.
